#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

#### **4.Show The Top 10 highest Paid Employees**

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [ ]:
import sqlite3
import pandas as pd

db_path = 'database.sqlite'
conn = sqlite3.connect(db_path)
cursor = conn.cursor()

task_1_query = """
SELECT JobTitle, AVG(TotalPayBenefits)
FROM Salaries
WHERE JobTitle NOT IN ('Not Provided', 'Not provided')
GROUP BY JobTitle;
"""
task_1_result = pd.read_sql(task_1_query, conn)

task_2_query = """
SELECT JobTitle, OvertimePay
FROM Salaries
WHERE OvertimePay > 50000;
"""
task_2_result = pd.read_sql(task_2_query, conn)

task_3_query = """
SELECT COUNT(DISTINCT EmployeeName)
FROM Salaries
WHERE EmployeeName NOT IN ('Not Provided', 'Not provided');
"""
task_3_result = pd.read_sql(task_3_query, conn)

task_4_query = """
SELECT EmployeeName, TotalPayBenefits
FROM Salaries
ORDER BY TotalPayBenefits DESC
LIMIT 10;
"""
task_4_result = pd.read_sql(task_4_query, conn)
task_5_query = """
SELECT EmployeeName, TotalPayBenefits
FROM Salaries
ORDER BY TotalPayBenefits DESC;
"""
task_5_result = pd.read_sql(task_5_query, conn)

conn.close()
task_1_result.head()
task_2_result.head()
task_3_result.head()
task_4_result.head()
task_5_result.head()

           EmployeeName  TotalPayBenefits
0        NATHANIEL FORD         567595.43
1           David Shinn         510732.68
2            Amy P Hart         479652.21
3  William J Coaker Jr.         436224.36
4        Gregory P Suhr         425815.28

In [ ]:
import pandas as pd
pd.set_option('display.max_rows', 10)
task_1_result

                                            JobTitle  AVG(TotalPayBenefits)
0                                      ACCOUNT CLERK           44035.664337
1                                         ACCOUNTANT           47429.268000
2                                  ACCOUNTANT INTERN           29031.742917
3                        ACPO,JuvP, Juv Prob (SFERS)           80266.370000
4                                      ACUPUNCTURIST           67594.400000
...                                              ...                    ...
2153                           X-RAY LABORATORY AIDE           52705.880385
2154                           X-Ray Laboratory Aide           69521.123200
2155  YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS           53632.870000
2156                              Youth Comm Advisor           60118.550000
2157                                     ZOO CURATOR           66686.560000

[2158 rows x 2 columns]

In [ ]:
pd.set_option('display.max_rows', 10)
task_2_result

                                              JobTitle   OvertimePay
0                      CAPTAIN III (POLICE DEPARTMENT)     106088.18
1                 WIRE ROPE CABLE MAINTENANCE MECHANIC      56120.71
2                   BATTALION CHIEF, (FIRE DEPARTMENT)       89062.9
3                   BATTALION CHIEF, (FIRE DEPARTMENT)      86362.68
4     ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)      71344.88
...                                                ...           ...
2163                           Parking Control Officer      54738.36
2164                                      Not provided  Not Provided
2165                                      Not provided  Not Provided
2166                                      Not provided  Not Provided
2167                                      Not provided  Not Provided

[2168 rows x 2 columns]

In [ ]:
pd.set_option('display.max_rows', 10)
task_3_result

   COUNT(DISTINCT EmployeeName)
0                        110808

In [ ]:
pd.set_option('display.max_rows', 10)
task_4_result

           EmployeeName  TotalPayBenefits
0        NATHANIEL FORD         567595.43
1           David Shinn         510732.68
2            Amy P Hart         479652.21
3  William J Coaker Jr.         436224.36
4        Gregory P Suhr         425815.28
5  Joanne M Hayes-White         422353.40
6        Gregory P Suhr         418019.22
7  Joanne M Hayes-White         417435.10
8       Ellen G Moffatt         415767.94
9        Gary Altenberg         407274.78